app/controllers/topics_controller.rb

SELECT  "topics".* FROM "topics" WHERE "topics"."name" = $1 LIMIT 1  [["name", "Algorithms"]]
---
	def show
		render json: Topic.find_by_name(params[:id])

SELECT  "topics".* FROM "topics" WHERE "topics"."name" = $1 LIMIT 1  [["name", "Algorithms"]]
SELECT "topics".* FROM "topics"
---
	def index
		if params['name'] != nil
			render json: Topic.where("name ILIKE ?", "%#{params[:name]}%")
		else
			render json: Topic.all