webapp/app/controllers/topics_controller.rb

	def index
		if params['name'] != nil
			# Use limit field to specify whether we want one or many records in response
			if params['limit'] != nil
				render json: Topic.find_by_name(params['name'])
---
SELECT  "topics".* FROM "topics" WHERE "topics"."name" = $1 LIMIT 1  [["name", "Algorithms"]]